{
  "title": "Eternal Sparkle: The Gold Diamond Ring",
  "storytelling_concept": "A cinematic journey capturing the exquisite craftsmanship and timeless elegance of the gold diamond ring. The video begins with an ultra-close macro reveal highlighting the intricate detailing and brilliant facets, then gracefully rotates to showcase the ring's sophisticated design. The slow, smooth movement combined with subtle sparkle highlights evokes a sense of luxury, refinement, and high-end allure, immersing viewers in the story of pure elegance.",
  "aesthetic_direction": "Dark, ultra-premium studio setting with a deep black velvet background. Emphasize high-contrast lighting, warm golden rim light, and sharp reflections to accentuate the ring's polished surface and sparkling diamonds. The mood is sophisticated, luxurious, and timeless, with cinematic depth and refined textures.",
  "lighting_mood": "Dramatic studio lighting with a focus on soft golden rim light that accentuates the warm tones of the yellow gold. Use subtle spotlighting to create high-contrast reflections on the diamonds and keep shadows deep and refined for a luxurious feel. Incorporate gentle slow-motion light flares to enhance brilliance and sparkle.",
  "product_focus_strategy": "Begin with an ultra-close macro shot to reveal the detailed craftsmanship of the diamond setting, the texture of the polished gold band, and the brilliance of the stones. Transition smoothly into a 360-degree rotation over a glossy reflective surface, highlighting the ring's elegant profile and the way light interacts with its facets. Maintain sharp focus throughout, emphasizing the clarity, sparkle, and high-quality finish of the ring.",
  "narrative_flow": "Start with an extreme macro shot of the central diamond and delicate side stones, highlighting their facets and clarity within 2 seconds. Gradually introduce the slow 360-degree rotation over the glossy reflective surface from 2 to 8 seconds, with subtle light flares reflecting off the diamonds and gold. As the rotation completes, zoom out slightly to showcase the ring in its full form, emphasizing the craftsmanship and luxurious aesthetic. End with a refined cinematic shadowing and soft focus, reinforcing the premium, high-end appeal of the jewelry."
}